In [ ]:
from google.colab import drive
drive.mount('/content/gdrive')

Mounted at /content/gdrive

In [ ]:
import pandas as pd
import numpy as np

**IMPORT DATASET**

In [ ]:
df = pd.read_csv("gdrive/MyDrive/Data Science/data/chipotle.tsv", sep= "\t")

In [ ]:
df.head(5)

   order_id  ...  item_price
0         1  ...      $2.39
1         1  ...      $3.39
2         1  ...      $3.39
3         1  ...      $2.39
4         2  ...     $16.98

[5 rows x 5 columns]

**DATASET OVERVIEW**

In [ ]:
df.shape

(4622, 5)

In [ ]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4622 entries, 0 to 4621
Data columns (total 5 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   order_id            4622 non-null   int64
 1   quantity            4622 non-null   int64
 2   item_name           4622 non-null   object
 3   choice_description  3376 non-null   object
 4   item_price          4622 non-null   object
dtypes: int64(2), object(3)
memory usage: 180.7+ KB

In [ ]:
# print all columns
list(df.columns)

['order_id', 'quantity', 'item_name', 'choice_description', 'item_price']

In [ ]:
df.index

RangeIndex(start=0, stop=4622, step=1)

In [ ]:
# statistic
df.describe()

          order_id     quantity
count  4622.000000  4622.000000
mean    927.254868     1.075725
std     528.890796     0.410186
min       1.000000     1.000000
25%     477.250000     1.000000
50%     926.000000     1.000000
75%    1393.000000     1.000000
max    1834.000000    15.000000

In [ ]:
# statistic all
df.describe(include = "all")

           order_id     quantity     item_name choice_description item_price
count   4622.000000  4622.000000          4622               3376       4622
unique          NaN          NaN            50               1043         78
top             NaN          NaN  Chicken Bowl        [Diet Coke]     $8.75
freq            NaN          NaN           726                134        730
mean     927.254868     1.075725           NaN                NaN        NaN
std      528.890796     0.410186           NaN                NaN        NaN
min        1.000000     1.000000           NaN                NaN        NaN
25%      477.250000     1.000000           NaN                NaN        NaN
50%      926.000000     1.000000           NaN                NaN        NaN
75%     1393.000000     1.000000           NaN                NaN        NaN
max     1834.000000    15.000000           NaN                NaN        NaN

**Location (loc) vs Index Location (iloc)**

In [ ]:
df.head()

   order_id  ...  item_price
0         1  ...      $2.39
1         1  ...      $3.39
2         1  ...      $3.39
3         1  ...      $2.39
4         2  ...     $16.98

[5 rows x 5 columns]

In [ ]:
df.loc[df.quantity == 15]

          order_id  quantity  ... choice_description item_price
3598          1443        15  ...                NaN    $44.25
quantity        15        15  ...                 15         15

[2 rows x 5 columns]

In [ ]:
# select all row with multiple conditions 
df.loc[(df.quantity == 15) | (df.item_name == "Nantucket Nectar")]

          order_id  quantity  ...         choice_description item_price
2                1         1  ...                    [Apple]     $3.39
22              11         1  ...       [Pomegranate Cherry]     $3.39
105             46         1  ...  [Pineapple Orange Banana]     $3.39
173             77         1  ...                    [Apple]     $3.39
205             91         1  ...             [Peach Orange]     $3.39
436            189         1  ...       [Pomegranate Cherry]     $3.39
601            247         2  ...  [Pineapple Orange Banana]     $6.78
925            381         1  ...       [Pomegranate Cherry]     $3.39
1356           553         1  ...       [Pomegranate Cherry]     $3.39
1585           641         1  ...             [Peach Orange]     $3.39
1626           656         1  ...  [Pineapple Orange Banana]     $3.39
1706           690         1  ...                    [Apple]     $3.39
2162           872         1  ...  [Pineapple Orange Banana]     $3.39
2379           947         2  ...             [Peach Orange]     $6.78
2381           947         1  ...                    [Apple]     $3.39
2430           965         1  ...       [Pomegranate Cherry]     $3.39
2653          1053         1  ...  [Pineapple Orange Banana]     $3.39
2818          1118         1  ...                    [Apple]     $3.39
2838          1128         1  ...             [Peach Orange]     $3.39
2853          1133         1  ...                    [Apple]     $3.39
2949          1172         1  ...             [Peach Orange]     $3.39
3318          1330         1  ...             [Peach Orange]     $3.39
3368          1351         1  ...  [Pineapple Orange Banana]     $3.39
3570          1433         1  ...  [Pineapple Orange Banana]     $3.39
3598          1443        15  ...                        NaN    $44.25
3845          1541         1  ...             [Peach Orange]     $3.39
4019          1609         1  ...  [Pineapple Orange Banana]     $3.39
4078          1632         1  ...             [Peach Orange]     $3.39
quantity        15        15  ...                         15         15

[29 rows x 5 columns]

In [ ]:
df.loc[(df.quantity == 2) & (df.item_name == "Nantucket Nectar"), ["quantity", "item_name", "choice_description", "item_price"]]

      quantity         item_name         choice_description item_price
601          2  Nantucket Nectar  [Pineapple Orange Banana]     $6.78
2379         2  Nantucket Nectar             [Peach Orange]     $6.78

In [ ]:
df.iloc[[9]]

   order_id  ...  item_price
9         5  ...      $9.25

[1 rows x 5 columns]

In [ ]:
type(df.iloc[[9]])

pandas.core.frame.DataFrame

In [ ]:
df.iloc[3:11]

    order_id  ...  item_price
3          1  ...      $2.39
4          2  ...     $16.98
5          3  ...     $10.98
6          3  ...      $1.69
7          4  ...     $11.75
8          4  ...      $9.25
9          5  ...      $9.25
10         5  ...      $4.45

[8 rows x 5 columns]

In [ ]:
X = df.iloc[3:6, :-1]
Y = df.iloc[3:6, -1]
print(X)
print(Y)

   order_id  ...                                 choice_description
3         1  ...                                                NaN
4         2  ...  [Tomatillo-Red Chili Salsa (Hot), [Black Beans...
5         3  ...  [Fresh Tomato Salsa (Mild), [Rice, Cheese, Sou...

[3 rows x 4 columns]
3     $2.39
4    $16.98
5    $10.98
Name: item_price, dtype: object

**DATA MANIPULATION**

In [ ]:
df.item_price.dtype

dtype('O')

In [ ]:
df["item_price"] = df["item_price"].astype(str).str.replace('$', '')
df.head(5)

   order_id  ...  item_price
0         1  ...        2.39
1         1  ...        3.39
2         1  ...        3.39
3         1  ...        2.39
4         2  ...       16.98

[5 rows x 5 columns]

In [ ]:
df["item_price"] = df["item_price"].astype(float)
df.item_price.dtype

dtype('float64')

In [ ]:
df.head(5)

   order_id  ...  item_price
0         1  ...        2.39
1         1  ...        3.39
2         1  ...        3.39
3         1  ...        2.39
4         2  ...       16.98

[5 rows x 5 columns]

In [ ]:
df["total_price"] = df["quantity"] * df["item_price"]
df.head(5)

   order_id  quantity  ... item_price total_price
0         1         1  ...       2.39        2.39
1         1         1  ...       3.39        3.39
2         1         1  ...       3.39        3.39
3         1         1  ...       2.39        2.39
4         2         2  ...      16.98       33.96

[5 rows x 6 columns]

**Tong Danh Thu Trong Dataset**

In [ ]:
revenue = df["total_price"].sum()
print(revenue)

39237.02

**Mon hang duoc order nhieu nhat**

In [ ]:
c = df.groupby("item_name")["quantity"].sum()
c.sort_values(ascending=False).head(5)

item_name
Chicken Bowl           761
Chicken Burrito        591
Chips and Guacamole    506
Steak Burrito          386
Canned Soft Drink      351
Name: quantity, dtype: int64

In [ ]:
# Cac mon hang khac nhau d
df.item_name.value_counts().count()

51

In [ ]:
df.item_name.nunique()

51